Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དགེ་སློང་རབ་ཏུ་སྙིང་རྗེར་ངུ་ཞིང་ཚོལ།
en: Weeping, they long for the greatly compassionate bhikṣu. May there be no obstacle to our life

source: །རྒྱལ་བ་མཆོག་གི་བསྟན་པ་འཇིག་པའི་ཚེ། །ཁྱོད་ཀྱི་སྲོག་གི་བར་ཆད་འགྱུར་དུ་དོགས།
en: In this time of the destruction of the supreme Jina’s teaching. {47}

source: །ཇི་ལྟར་སྐྱེས་བུ་མཐུ་ཆེན་ལ་ལ་དག །ཕྱོགས་དང་ཕྱོགས་མཚམས་རྟག་ཏུ་སྒྲ་གྲགས་པ།
en: “ ‘Just as some beings who have great power— Ever renowned throughout the ten directions

source: །སྲིད་གསུམ་འདི་ཀུན་ཐམས་ཅད་ཟིལ་མནན་ནས།
en: And outshining all in these three existences—

source: །གཡངས་ཆེན་པོར་མཆོངས་ཏེ་སར་ལྷུང་ལྟར།
en: Leap down from a great height on to the earth, {48}

source: །དེ་བཞིན་དགེ་སློང་མཚན་མཆོག་རབ་བརྒྱན་པ། །བྱད་བཞིན་བཟང་པོ་ས་འདིར་འགྱེལ་བར་གྱུར།
en: “ ‘In the same way, this bhikṣu has fallen to the earth

source: །མེ་ཏོག་ཟླ་མཛེས་ཞེ་སྡང་གཏུམ་མེད་པ།
en: With a body beautified by the supreme signs.

source: །བདག་གི་སྡིག་པའི་སེམས་ཀྱིས་དུམ་བུར་རླགས། །མེ་ཏོག་ཟླ་མཛེས་བཀྲོངས་ནས་སར་ལྷུང་བ།
en: With an evil intention, I have reduced to pieces

source: །ཆོས་སྨྲ་འདི་ནི་མཐོང་ནས་མྱུར་བར་ཡང་།
en: Supuṣpacandra, who was faultless and blameless. {49}

source: །དགེ་སློང་ཐམས་ཅད་སྡུག་བསྔལ་གཟིར་གྱུར་ཏེ།
en: “ ‘All the bhikṣus will be stricken by suffering,

source: །མི་དགའ་སྐྱེས་འགྱུར་དེ་བཞིན་སེམས་མི་བདེ།
en: Will be dismayed and similarly grief-stricken As soon as they see this dharmabhāṇaka, Supuṣpacandra, slain and fallen to the ground. {50}

source: །མེ་ཏོག་ཟླ་མཛེས་རི་ཡི་རྒྱལ་པོ་ལྟར།
en: “ ‘Supuṣpacandra, who was like the king of mountains,

source: །ཕྲེང་བ་བརྒྱུས་པ་བུད་མེད་ཐོགས་པ་འདྲ། །འདིར་ནི་དུམ་བུ་དུམ་བུར་རྣམ་པར་བཅད།
en: Like a flower garland held by a woman. {51}

source: །བདག་གིས་དངོས་སྡིག་ཤིན་ཏུ་མི་བཟད་བགྱིས།
en: “ ‘I have created the worst bad karma.

source: །མགོན་མེད་མནར་མེད་གཤིན་རྗེའི་ཡུལ་དུ་མཆི།
en: I shall helplessly go to Avīci, to Yama’s realm.

source: །འདིར་ཡང་དགེ་སློང་དུམ་བུར་རླགས་པ་ཡིས།
en: Having reduced the bhikṣu to pieces,

source: །བདག་ནི་སངས་རྒྱས་རྣམས་དང་རིང་བས་རིང་། །བདག་གིས་ཤིན་ཏུ་ལས་ངན་བགྱིས་པས་ན།
en: I am at the furthest distance from buddhahood. {52}

source: །བུ་དང་གཉེན་བཤེས་ཚོགས་རྣམས་སྐྱབས་མི་འགྱུར།
en: “ ‘My sons will not save me, nor my family,

source: །བློན་པོ་དང་ནི་ཞབས་འབྲིང་བཀྲབས་པ་ཡང་།
en: Nor my ministers, nor the slaves at my feet.

source: །དེ་དག་དམྱལ་བར་བདག་སོང་སྐྱབས་མི་འགྱུར།
en: They will not save me from going to hell For I have myself created the worst bad karma. {53}

source: །སངས་རྒྱས་འདས་དང་དེ་བཞིན་མ་བྱོན་དང་། །ཕྱོགས་བཅུ་དག་ན་གང་སུ་བཞུགས་པ་ཡི།
en: “ ‘I go for refuge to the buddhas of the past, of the future, And those now present in the ten directions,

source: །དེད་དཔོན་སྟོབས་བཅུ་ཉོན་མོངས་མེད་པ་རྣམས།
en: Those leaders who have the ten strengths,

source: །རྡོ་རྗེ་སྟུག་སྲ་སྐུ་མངའི་སྐྱབས་སུ་མཆི།
en: Have no kleśas, and have bodies as invincible as vajras!’ {54}

source: །དེར་ནི་དགེ་སློང་དུམ་བུར་བྱས་མཐོང་ནས། །ལྷ་རྣམས་རབ་ཏུ་སྙིང་རྗེ་ཆོ་ངེས་འདེབས།
en: “The devas there wailed pitifully When they saw the bhikṣu in pieces.

source: །དེ་དག་དེར་སོང་དགེ་འདུན་གོ་བར་བྱས།
en: They went to inform the saṅgha

source: །མེ་ཏོག་ཟླ་མཛེས་རྒྱལ་པོའི་ཁབ་འདིར་བསད།
en: That Supuṣpacandra had been slain in the capital. {55}

source: །ཆོས་སྨྲ་བ་ནི་མཁས་ཤིང་རྟོགས་པ་དེ།
en: “ ‘The wise and learned dharmabhāṇaka,

source: །མཐུ་ཆེན་ཕྱོགས་དང་ཕྱོགས་མཚམས་རབ་ཏུ་གྲགས།
en: Powerful and renowned in all directions,

source: །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གནས་པ་དེ།
en: The bodhisattva who was established in retention,

source: །བསྐལ་པ་མཐའ་ཡས་སྦྱིན་པ་སྣ་ཚོགས་བྱིན།
en: “ ‘He who for countless eons practiced generosity,

source: །ཚུལ་ཁྲིམས་མི་གཡོ་སྐྱོན་མེད་གང་སྲུང་ཞིང་།
en: Maintained faultless, unwavering conduct,

source: །འཇིག་རྟེན་ཀུན་ཏུ་མཚུངས་མེད་བཟོད་སྒོམ་པ།
en: And had unequaled patience within all worlds,

source: །བསྐལ་པ་མཐའ་ཡས་རྟག་ཏུ་བརྩོན་ལྡན་ཞིང་།
en: “ ‘He who for countless eons was always diligent,

source: །ཞུམ་མེད་སེམས་ཀྱིས་བསམ་གཏན་བཞི་ལ་སྒོམ།
en: Confidently meditated on the four dhyānas,

source: །ཉོན་མོངས་འཇོམས་པའི་ཤེས་རབ་གང་བསྟེན་པ།
en: And had the wisdom that eliminated the kleśas,

source: །ལུས་ལ་ཕངས་པ་ཐམས་ཅད་རབ་སྤངས་ཤིང་། །དེ་བཞིན་སྲོག་ལ་མ་ཆགས་གྱུར་ནས་ནི།
en: “ ‘He who gave up all attachment to his body, Who had no regard for his own life,

source: །ཀུན་ཏུ་བཟང་པོའི་ནགས་ནས་བབས་ནས་སུ།
en: And departed from Samantabhadra Forest,

source: །ལྷ་ཡི་ཆོ་ངེའི་སྙིང་རྗེ་ཐོས་ནས་ནི།
en: “Having heard the pitiful wailing of the devas,

source: །དགེ་སློང་དེ་ཀུན་ཤིན་ཏུ་སྡུག་བསྔལ་ནས། །མེ་ཏོག་ཟླ་མཛེས་ཉེས་མེད་བསད་པ་ལ།
en: All the bhikṣus experienced great suffering.

source: །ལྟ་བའི་ཕྱིར་ཡང་ཐམས་ཅད་གྲོང་དུ་ལྷགས།
en: They all went to the city in order to see The slain, innocent Supuṣpacandra. {i}

source: །དེས་པ་དེ་དག་རྒྱལ་པོའི་ཁབ་འོངས་ནས།
en: “Those compassionate ones came to the capital

source: །དགེ་སློང་དུམ་བུ་དུམ་བུར་བྱས་མཐོང་སྟེ།
en: And when they saw the bhikṣu cut into pieces

source: །ཉམ་ཐག་སྐད་ཀྱིས་མི་བཟད་ཆོ་ངེས་འདེབས། །དེ་དག་ཐམས་ཅད་བརྒྱལ་ནས་ས་ལ་འགྱེལ།
en: They all wailed terribly in distress And they fainted and fell to the ground. {60}

source: །དགེ་སློང་དགེ་འདུན་རྒྱལ་པོ་དེ་ལ་སྨྲ། །ཚུལ་ཁྲིམས་སྐྱོན་མེད་ཤིན་ཏུ་བསྡམས་པ་ཡི།
en: “The saṅgha of bhikṣus asked the king,

source: །དགེ་སློང་འདིས་ནི་ཉེས་པ་ཅི་ཞིག་བྱས།
en: ‘Why did you commit this offence against a bhikṣu Who maintained correct conduct without a fault,

source: །འདི་ནི་སྔོན་གྱི་སྐྱེ་བ་བསམ་ཡས་དྲན།
en: And could remember countless previous lives? {61}

source: །འདི་ནི་ཡེ་ཤེས་གཟུངས་དབང་ཕ་རོལ་ཕྱིན།
en: “ ‘He had attained the power of wisdom and retention,

source: །འདི་ནི་འདུས་བྱས་འདི་དག་སྟོང་པར་ཤེས།
en: He knew that everything composite was empty,

source: །འདི་ནི་འགྲོ་བ་དག་ལ་མཚན་མེད་སྟོན།
en: He taught the absence of attributes to beings,

source: །འདི་ནི་སྨོན་ལམ་འདུ་ཤེས་ཐམས་ཅད་སྤངས།
en: And had abandoned all concepts of aspiration. {62}

source: །འདི་ནི་ཡིད་འོང་སྙན་པའི་སྒྲ་དབྱངས་འབྱིན།
en: “ ‘He had pleasant and delightful speech,

source: །འདི་ནི་ངེས་ཤིང་དབང་པོ་རབ་ཏུ་ཞི།
en: He had pacified senses and was amiable,

source: །འདི་ནི་སྔོན་གྱི་གནས་ཀྱི་ཕ་རོལ་ཕྱིན།
en: He had complete knowledge of others’ previous lives,

source: །འཇིག་རྟེན་ཐམས་ཅད་ལས་ཀྱང་མངོན་པར་འཕགས།
en: And he had transcended the world. He was the portrait of a supreme leader

source: །འདི་ནི་སངས་རྒྱས་རང་བྱུང་ཡེ་ཤེས་ཀྱིས། །ཁྱུ་མཆོག་གྱུར་ཅིང་འཇིག་རྟེན་རི་མོར་བྱས།
en: With the wisdom of self-arisen buddhahood;

source: །དག་ཅིང་རབ་རིབ་མེད་པའི་མིག་གིས་ལྟ།
en: He saw with pure and unobscured eyes

source: །བྱམས་པ་དང་ནི་སྙིང་རྗེ་ཤིན་ཏུ་ཆེ།
en: And had extremely great love and compassion. {63}

source: །འདོད་པ་ངན་ཅིང་བཙོག་ལ་སྡུག་བསྔལ་སྐྱེད།
en: “ ‘Killing through evil desires and causing suffering

source: །མཐོ་རིས་རྣམ་པར་མ་རུང་བྱེད་པ་སྟེ།
en: Destroys rebirth in the upper realms.

source: །འདོད་པ་བསྙེན་ན་རྣ་བ་མེད་པར་འགྱུར།
en: People who are dedicated to their desires

source: །མི་དག་ཤེས་རབ་དང་ཡང་བྲལ་བར་འགྱུར།
en: Become deaf and devoid of wisdom.

source: །མི་རྣམས་འདོད་པ་དག་ནི་བསྙེན་བྱས་ན།
en: People who are dedicated to their desires

source: །ལོང་བར་འགྱུར་ཞིང་ཕ་དང་མ་ཡང་གསོད།
en: Become blind and murder their fathers and mothers.

source: །འདོད་པ་བསྙེན་བྱས་ཚུལ་ཁྲིམས་ལྡན་པ་གསོད།
en: People who are dedicated to their desires slay those with correct conduct,

source: །དེ་བས་མི་ཡིས་འདོད་པ་རྣམ་པར་སྤང་།
en: And therefore people should forsake desires. {64}

source: །རྒྱལ་པོས་འདོད་པ་དག་ནི་བསྙེན་བྱས་ན།
en: “ ‘The kings who are dedicated to their desires,

source: །ས་བདག་དམ་པ་འབྱོར་པ་འདི་བོར་ནས།
en: Those rulers of the world throw away their prosperity

source: །མི་བཟད་སྡུག་བསྔལ་རྩུབ་བྱེད་སེམས་དམྱལ་ནས། །སེམས་ཅན་དམྱལ་བ་འཇིགས་པ་ཆེན་པོར་འགྲོ།
en: And go to the dreadful, terrible hells That cause suffering and endless fear.

source: །འདི་འདྲའི་དགེ་སློང་མཁས་པ་གསོད་བྱེད་དེ། །སྡིག་པའི་ལས་རྣམས་རྟག་ཏུ་བྱེད་པར་འགྱུར།
en: This kind of bad karma is always created By the slaying of a wise bhikṣu.

source: །དེ་ཕྱིར་བྱང་ཆུབ་ཞི་བ་སུ་འདོད་པ།
en: Therefore one who wishes for the peace of enlightenment

source: །སྡིག་པ་རྣམ་པ་སྣ་ཚོགས་སྤང་བར་བྱ།
en: Should abandon every kind of bad action. {65} “ ‘A jina, without dismay, gives away the best forms,

source: །ལུས་ནི་སྒྱུ་མ་གསོག་དང་འདྲ་བ་དང་། །དེ་བཞིན་རྣ་མིག་སྣ་ལྕེ་རིག་ནས་ནི། །གཟུགས་དང་སྒྲ་དང་དེ་བཞིན་དྲི་མཆོག་དང་། །རེག་བྱ་ཆོས་རྣམས་ཞུམ་མེད་སེམས་ཀྱིས་གཏོང་།
en: Sounds, tastes, smells, tangibles, and phenomena. He knows the body is like an illusion and chaff, As are the ears, eyes, nose, and tongue. {66}

source: །སྦྱིན་ལ་བསླབས་ཤིང་ཚུལ་ཁྲིམས་མཉམ་པ་མེད།
en: “ ‘He trains in unequaled generosity,

source: །བཟོད་པ་དང་ནི་བརྩོན་འགྲུས་དེ་བཞིན་ཏེ།
en: correct conduct, patience, and diligence.

source: །བསམ་གཏན་སྟེན་ཅིང་ཤེས་རབ་ཕ་རོལ་སོང་།
en: He is dedicated to dhyāna, attains perfect wisdom,

source: །སེམས་ཅན་དག་གི་དོན་ཀྱང་རབ་ཏུ་བྱེད།
en: And accomplishes the benefit of beings.

source: །འཇིག་རྟེན་ལྷ་དང་མིར་བཅས་ཐམས་ཅད་ཀྱང་།
en: The entire world with its devas and humans

source: །བྱམས་པས་རྒྱལ་བ་ལ་ནི་རབ་ཏུ་ལྟ།
en: Together look with love upon a jina.

source: །དེ་ཕྱིར་མིག་ནི་མུན་གནག་གཏིབས་གྱུར་ཀྱང་།
en: Thereby, with eyes that have been freed from blindness,

source: །བྱང་ཆུབ་ཞི་བ་ཉིད་ནི་འཚང་རྒྱ་འགྱུར།
en: They become enlightened, attaining the peace of buddhahood. {67} “ ‘The jinas joyfully give away horses,

source: །རྟ་དང་བལ་གླང་ཡང་ཐོགས་ཁྲི་རྣམས་དང་། །ཁྱོགས་དང་སྔས་རྣམས་ཀྱང་ནི་དེ་བཞིན་ཏེ།
en: Elephants, litters, palanquins, Couches, bulls, and carriages,

source: །གླང་པོ་དག་དང་བཞོན་དང་དགལ་བ་དང་། །གྲོང་དང་ཡུལ་འཁོར་དགའ་བ་གཏོང་བར་བྱེད།
en: Wagons, villages, and regions.

source: །གྲོང་ཁྱེར་དང་ནི་རྒྱལ་སྲིད་ཡོངས་གཏོང་ཞིང་།
en: They give away towns and kingdoms,

source: །གསེར་དང་དངུལ་དང་ཤེལ་དང་བྱི་རུ་དང་། །དེ་བཞིན་གནས་དང་བུ་དང་བུ་མོ་དང་། །རང་གི་མགོ་ཡང་གཏོང་ཞིང་བྱང་ཆུབ་ཞུགས།
en: Gold, silver, crystal, and coral. They give away wives, sons, daughters, And their own heads, and are established in enlightenment. {68}

source: །མེ་ཏོག་དང་ནི་སྤོས་དང་བདུག་པ་དང་། །གདུགས་དང་རྒྱལ་མཚན་ལྷ་ཡི་བ་དན་དང་། །རོལ་མོའི་ཆ་སྤྱད་སྣ་ཚོགས་ཐོགས་ནས་ནི། །དགའ་ནས་མཆོད་པ་མཚུངས་པ་མེད་པ་བྱེད།
en: “ ‘They joyfully make unequaled Offerings of flowers and incense, Holding parasols, banners, divine flags, And musical instruments of various kinds.

source: །སྲིད་པ་དག་ནི་སྟོང་པར་ཤེས་ནས་ཀྱང་།
en: They know existence to be empty

source: །སྲིད་པའི་འགྲོ་བ་དག་ལ་དགའ་མི་བྱེད།
en: And do not rejoice in rebirth in existence.

source: །དེ་ཕྱིར་སྟོབས་བཅུ་མཚན་གྱིས་རྣམ་བརྒྱན་ཅིང་།
en: They have the ten strengths, are adorned by the signs,

source: །ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་ཡང་སྣང་བར་བྱེད།
en: And they illuminate all ten directions. {69}

source: །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གང་གནས་པ།
en: “ ‘The bodhisattvas established in retention

source: །འདོད་པའི་ཁམས་རྣམས་དང་ནི་གཟུགས་ཀྱི་ཁམས། །གཟུགས་མེད་ཁམས་ལ་དེ་དག་མི་ཆགས་ཏེ། །ཁམས་གསུམ་དག་ལ་སྔ་ནས་ཆགས་པ་མེད།
en: Have no attachment to the phenomena of the three realms. They have no attachment to the realm of desire, To the form realm, or to the formless realm. {70}

source: །བདག་ཏུ་འདུ་ཤེས་སེམས་ཅན་འདུ་ཤེས་མེད།
en: Have no concept of a self, no concept of being,

source: །སྲོག་ཏུ་འདུ་ཤེས་གང་ཟག་འདུ་ཤེས་མེད།
en: No concept of a soul, and no concept of an individual,

source: །ཚངས་པར་སྤྱོད་པ་མ་འདྲེས་རྟག་ཏུ་སྤྱད།
en: And always practice unsullied celibacy. {71}

source: །དངོས་པོར་འདུ་ཤེས་དངོས་མེད་འདུ་ཤེས་མེད།
en: Have no concept of things and no concept of nothing,

source: །བདེ་བར་འདུ་ཤེས་མི་བདེར་འདུ་ཤེས་མེད།
en: No concept of happiness and no concept of unhappiness,

source: །གྲངས་སུ་འདུ་ཤེས་གྲངས་མེད་འདུ་ཤེས་མེད། །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གང་གནས་པ།
en: And no concept of number and no concept of numberlessness. {72}

source: །ཡོད་པར་འདུ་ཤེས་མེད་པར་འདུ་ཤེས་མེད།
en: “ ‘They have no concept of existence and no concept of nonexistence,

source: །བུད་མེད་འདུ་ཤེས་སྐྱེས་པར་འདུ་ཤེས་མེད།
en: No concept of woman and no concept of man,

source: །གྲོང་གི་འདུ་ཤེས་གྲོང་ཁྱེར་འདུ་ཤེས་མེད། །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གང་གནས་པ།
en: No concept of villages and no concept of towns,

source: །ཡུལ་འཁོར་འདུ་ཤེས་གྲོང་འདབ་འདུ་ཤེས་མེད།
en: And no concept of regions and no concept of market towns. {73} “ ‘The bodhisattvas established in retention

source: །འདོད་ཆགས་འདུ་ཤེས་འདོད་བྲལ་འདུ་ཤེས་མེད།
en: Have no concept of desire and no concept of no desire,

source: །ཞེ་སྡང་འདུ་ཤེས་སྡང་བྲལ་འདུ་ཤེས་མེད།
en: No concept of stupidity and no concept of no stupidity,

source: །གཏི་མུག་འདུ་ཤེས་རྨོངས་བྲལ་འདུ་ཤེས་མེད།
en: And no concept of ignorance and no concept of no ignorance. {74}

source: །ང་རྒྱལ་ང་རྒྱལ་བྲལ་བའི་འདུ་ཤེས་མེད།
en: Have no concept of pride and no concept of no pride,

source: །མ་རིག་མ་རིག་མ་ཡིན་འདུ་ཤེས་མེད།
en: No concept of ignorance and no concept of no ignorance,

source: །ལྟ་དང་ལྟ་བ་མ་ཡིན་འདུ་ཤེས་མེད།
en: And no concept of view and no concept of no view. {i}

source: །དེ་དག་དབང་པོ་སྟོབས་ལ་མི་ཆགས་ཏེ།
en: Have no attachment to the powers and the strengths,

source: །བྱང་ཆུབ་ཡན་ལག་བསམ་གཏན་ཆགས་པ་མེད།
en: No attachment to the dhyānas and the aspects of enlightenment,

source: །ཁམས་གསུམ་ཉེས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་།
en: And have abandoned all the evils in the three realms. {75}

source: །འདོད་ཆགས་ཆགས་མེད་ཞེ་སྡང་གཏུམ་པ་མེད།
en: “ ‘They have no desire or passion, no anger or rage;

source: །གཏི་མུག་རྨོངས་མེད་རྟག་ཏུ་གཡོ་མེད་འགྱུར།
en: They have no ignorance or dullness, and are always honest.

source: །སངས་རྒྱས་སྟོབས་བཅུ་མཐོང་ནས་བཀུར་སྟི་བྱེད། །བློ་གྲོས་ལྡན་པ་མཐོ་རིས་སྨོན་མི་བྱེད།
en: When they see the buddhas with their ten strengths, they honor them. And they do not gain knowledge for the sake of rebirth in the higher realms. {76}

source: །སུ་དག་གཞན་ལས་ཆོས་མཆོག་ཐོས་ནས་ནི།
en: “ ‘When they hear the unique Dharma from another,

source: །དེ་ལ་ནམ་ཡང་ནེམ་ནུར་མི་བྱེད་པ།
en: They never have any doubt in it.

source: །འབྲུ་མར་གང་བའི་སྣོད་བཞིན་དང་ཞིང་དག །བཅད་དང་མ་བཅད་གཞན་གྱི་བློ་ཡང་ཤེས།
en: They know if there is deficiency or not in others’ minds, Like looking into a clear, pure bowl of sesame oil. {77}

source: །མཛའ་བ་བྱས་ན་རྗེས་སུ་ཆགས་པ་སྐྱེ། །དེ་ཡང་ཉོན་མོངས་པ་ནི་ཆེན་པོ་ཡིན།
en: “ ‘If attachment develops, That friendliness is a great kleśa.

source: །ཞེ་སྡང་བྱས་ན་ཁོང་ཁྲོ་སྐྱེ་བར་འགྱུར།
en: If anger develops then that aggression

source: །དགྲ་དང་འཇིགས་པ་སྡིག་པ་རྣམས་ཀྱང་འབྱུང་།
en: Brings evil, enmity, and fear.

source: །འདི་གཉིས་རབ་ཏུ་རྣམ་པར་སྤང་བྱས་ཏེ།
en: Completely rejecting both of those,

source: །བློ་གྲོས་ལྡན་པ་དག་ནི་བྱང་ཆུབ་ཞུགས།
en: The wise ones are established in enlightenment.

source: །དེ་དག་མི་ཡི་ཁྱུ་མཆོག་སྟོབས་བཅུར་ནི། །འཇིག་རྟེན་དུ་ཡང་མངོན་པར་འབྱུང་བར་འགྱུར།
en: They become here the great leaders of humans, Endowed with the ten strengths, appearing in the world. {78}

source: །ནང་དང་ཕྱི་རོལ་དག་ཀྱང་རྣམ་སྤངས་ཏེ།
en: “ ‘They abandon the internal and the external

source: །ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་རབ་གནས་ཤིང་།
en: And remain in the nature of phenomena.

source: །ཚུལ་ཁྲིམས་ཕུང་པོ་དག་ཀྱང་རྣམ་པར་སྦྱངས།
en: They have correct conduct that is pure,

source: །རལ་བ་མེད་ཅིང་མ་འདྲེས་སྐྱོན་ཡང་མེད།
en: Without defect, unsullied, and faultless. Their conduct is never sullied

source: །ནམ་ཡང་དེ་དག་གི་ནི་ཚུལ་ཁྲིམས་དག །འཕགས་ཤིང་འདྲེས་པ་དག་ཏུ་མི་འགྱུར་ཏེ།
en: And it is never corrupted.

source: །མཐའ་འདི་དག་ནི་གཉིས་པོ་ཡོངས་སྤངས་ནས།
en: The wise ones avoid attachment and anger

source: །བློ་གྲོས་འཆང་བ་བྱང་ཆུབ་ཞི་རྟོགས་འགྱུར།
en: And attain the peace of enlightenment.’ {79}

source: །དེ་ནས་རྒྱལ་པོ་དཔའ་བས་བྱིན་གྱིས་དགེ་སློང་གི་དགེ་འདུན་ལས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་ཀྱི་ཡོན་ཏན་བྱེ་བྲག་ཆེན་པོ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཐོས་ནས་སྡུག་བསྔལ་ཞིང་ཡིད་མི་དགའ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་ལ་ཚིགས་སུ་བཅད་པས་སླར་སྨྲས་པ།
en: “After King Śūradatta had heard from the saṅgha what vast, extensive, and special qualities the dharmabhāṇaka Supuṣpacandra had, he was in suffering and unhappy, and therupon he recited these lines of verse to that great assembly of bodhisattvas:

source: ནགས་ཁྲོད་སྟུག་པོ་ཀུན་ཏུ་བཟང་པོ་ནི།
en: “ ‘The dense forest of Samantabhadra,

source: །སྡོང་པོ་ཆེན་པོས་གང་ཞིང་འབྲས་བུས་མཛེས།
en: Filled with great trees and beautified by fruit,

source: །དུས་ཀུན་སྐྱེ་བ་མེ་ཏོག་སྡུག་པས་བརྒྱན།
en: Adorned by beautiful flowers that appear in all seasons

source: །སྣ་ཚོགས་ཐ་དད་བྱ་རྣམས་སྒྲ་ཡང་འབྱིན།
en: And where various birds sing their songs, {i}

source: །གསེར་གྱི་རི་ཡང་མཛེས་ཤིང་མཐོ་བས་བརྒྱན།
en: “ ‘And adorned by tall, stately, golden mountains

source: །མི་འམ་ཅི་ཡི་གླུ་དབྱངས་སྙན་པ་དང་། །རོལ་མོ་ཤིན་ཏུ་ཐབས་ལྡན་ཡིད་འོང་གྲག །གྲུབ་པའི་བུ་མོ་རྟག་ཏུ་གར་ཡང་བྱེད།
en: And by the tuneful song of kinnaras, By skillfully created, pleasant music, And the constant dancing of adept maidens— {ii}

source: །ནགས་དེ་ལྷ་ཡི་དགའ་བའི་ཚལ་བཞིན་ཏེ།
en: “ ‘That forest is like a deva’s park,

source: །གཟུགས་བཟང་གཟུགས་འབར་བ་ཡི་ཤིང་གིས་དཀྲིགས།
en: With trees that have beautiful, shining forms,

source: །མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་བཀྲམ།
en: With a carpet of various kinds of flowers,

source: །ཨུད་པལ་པད་མོས་བརྒྱན་ཅིང་ཆུ་ཡང་འབབ།
en: And with rivers adorned by blue and red lotuses. {iii} “ ‘Sages constantly live in harmony

source: །འདི་འདྲ་བ་ཡི་ནགས་མཆོག་ཉམས་དགའ་བ།
en: Within such a delightful forest.

source: །དྲང་སྲོང་རྟག་ཏུ་གནས་པར་འཐུན་པ་དག །བོར་ནས་སེམས་ཅན་དོན་དང་ཕན་བཞེད་པས།
en: He departed from it wishing to benefit beings

source: །སྡིག་པའི་ཕུང་པོ་བདག་དྲུང་གྲོང་དུ་བྱོན།
en: And came to my city, which is a mass of sin. {iv}

source: །དེ་ལྟར་ཆོས་སྨྲ་ཡོན་ཏན་འཆང་བ་འདི།
en: “ ‘That dharmabhāṇaka with excellent qualities,

source: །མེ་ཏོག་ཟླ་མཛེས་གྲོང་ཁྱེར་འདིར་བྱོན་ཏེ།
en: Supuṣpacandra, came here to this city.

source: །བྱོན་ནས་སྡིག་པ་བགྱིད་པ་བདག་གིས་བཀྲོངས།
en: When he came I committed the evil action of having him slain,

source: །འདི་བཀྲོངས་པས་ནི་བདག་ཀྱང་དམྱལ་བར་ལྟུང་།
en: And because of his death I am going to fall down into hell. {v}

source: །བྱང་ཆུབ་སེམས་དཔའི་ཐུགས་རྗེའི་སྟོབས་ལྡན་གང་།
en: “ ‘May the bodhisattvas who have the power of compassion,

source: །དཔའ་བོ་སེམས་ཅན་ཕན་ཕྱིར་འཇིག་རྟེན་སྤྱོད།
en: The heroes who act in this world to benefit beings,

source: །དེ་དག་སྡིག་བགྱིད་བདག་གི་སྐྱབས་མཛོད་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་དེ་སྐྱབས་བདག་མཆིའོ།
en: Give their protection to me, who have done such evil things: I go to those bodhisattvas for refuge. {vi}

source: །གང་ཡང་རང་རྒྱལ་དག་ནི་གཉིས་པ་དང་། །གང་གཞན་ཉན་ཐོས་རྫུ་འཕྲུལ་ལྡན་པ་སྟེ།
en: “ ‘Secondly, those who are pratyekabuddhas, And also śrāvakas with miraculous powers,

source: །བདག་ནི་སྡུག་བསྔལ་མནར་མེད་མཆི་བ་སྐྱོབས།
en: Save me from the suffering of being reborn in the Avīci hell!’ ” {vii}

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་ཀུན་དགའ་བོ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལུས་དང་སྲོག་ལ་མ་ཆགས་པར་བྱའོ།
en: Then at that time the Bhagavān said to Ānanda, “In that way, Ānanda, the bodhisattva mahāsattva has no attachment to life or body.

source: ཀུན་དགའ་བོ་ལུས་དང་སྲོག་ལ་ཆགས་པའི་སེམས་ཅན་རྣམས་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་པར་འགྱུར་རོ།
en: Because, Ānanda, beings who have attachment to life and body create bad karma.

source: རྟག་ཏུ་རུལ་བའི་ལུས་འདི་དང་། །སྲོག་ཀྱང་གཡོ་ཞིང་དབང་མེད་དེ།
en: To this body, which is constantly rotting, And to this life, unstable and powerless,

source: །རྨི་ལམ་སྒྱུ་མ་འདྲ་བ་ལ། །སེམས་ཅན་གང་དག་ཆགས་པ་ནི།
en: Which is like a dream or an illusion, {viii} “They fall under the power of ignorance

source: །ཤིན་ཏུ་མ་རུངས་ལས་བྱས་ནས། །གཏི་མུག་དབང་སོང་དེ་དག་ནི། །སེམས་ཅན་དམྱལ་བ་མི་བཟད་པར། །མི་མཁས་བདུད་ཀྱི་གཞོལ་བས་སོང་།
en: And create extremely dreadful karma. Devoid of wisdom, following Māra, They are reborn in the terrible hells. {ix} “Those humans who are indifferent

source: །དབུ་བ་རྡོས་འདྲའི་ལུས་དང་ནི།
en: To their bodies, which are like lumps of foam,

source: །ཆུ་ཡི་ཆུ་བུར་འདྲ་སྲོག་ལ། །མི་གང་ཆགས་པར་མི་བྱེད་པ།
en: And their lives, which are like water bubbles,

source: །དེ་དག་འགྲོ་བ་མཆོག་ཏུ་འགྲོ།
en: Will become supreme beings.” {x}

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བྱས་ཏེ།
en: Then the Bhagavān said to Brother Ānanda, “Ānanda, in that way bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should train in this samādhi, and should have no regard for their bodies or lives.

source: མགོ་དང་གོས་ལ་མེ་འབར་བ་བཞིན་དུ་བརྩོན་འགྲུས་བརྩམས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་དེ་དཔེར་ན་དབེན་པ་ན་བདེ་བར་གནས་པ་དང་དགོན་པ་དང་། ནགས་ཁྲོད་སྤངས་ཏེ་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་ལྗོངས་དང་ཡུལ་འཁོར་དང་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་རི་ཁྲོད་རྣམས་སུ་ཞུགས་ཏེ། ཅི་ནས་སེམས་ཅན་དེ་དག་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་དང་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟ་བུར་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བྱའོ།
en: They should be as diligently dedicated as they would if their hair or clothes were on fire, and have great compassion for all beings. For example, they should give up living happily in solitude, solitary places, and forests, and enter the villages, the towns, the market towns, the regions, the kingdom, the capital, and district capitals, and there teach the Dharma to beings so that beings can attain irreversible progress toward the enlightenment of the śrāvaka, irreversible progress toward the enlightenment of the pratyekabuddha, or irreversible progress toward the highest, complete enlightenment.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་སྔོན་བྱུང་བའི་གཏམ་བསྟན་པ་འདི་ཉིད་རྒྱ་ཆེར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱས་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Thereupon the Bhagavān gave a detailed teaching on this episode from the past by chanting the following verses to Brother Ānanda:

source: །ངས་སྔོན་སྤྱད་པ་དག་ནི་སྤྱོད་པ་ན།
en: “At that past time, when I was practicing bodhisattva conduct,

source: །དེ་ཚེ་རྒྱལ་པོ་དཔའ་བས་བྱིན་པར་གྱུར།
en: I was King Śūradatta.

source: །རྒྱལ་པོའི་ཕོ་བྲང་རིན་ཆེན་ལྡན་ཞེས་བྱ།
en: I left my capital city Ratnāvatī

source: །སྐྱེད་མོས་ཚལ་གྱི་སར་ནི་བྱུང་བར་གྱུར།
en: On the way to a place that was a park. {80}

source: །ཤིང་རྟར་ཞུགས་པས་དེ་ཚེ་དགེ་སློང་མཐོང་།
en: “While riding in the chariot I saw a bhikṣu

source: །ཀུན་ནས་མཛེས་ཤིང་བལྟ་ན་སྡུག་པ་སྟེ།
en: Who was perfectly handsome and attractive,

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱི་གོ་བགོས་པ།
en: Wearing the armor of the thirty-two signs,

source: །ཕྱོགས་རྣམས་ཐམས་ཅད་དུ་ཡང་སྣང་བར་བྱེད།
en: And he illuminated all directions. {81}

source: །མེ་ཏོག་ཟླ་མཛེས་ཕྱོགས་སུ་གྲགས་པ་སྟེ།
en: “He was renowned as Supuṣpacandra,

source: །སྙིང་རྗེ་གནས་པ་ཕན་ཞིང་སྙིང་བརྩེ་བ།
en: And was compassionate, beneficial, and kind.

source: །དཔལ་དང་གཟི་བརྗིད་དག་གིས་མཛེས་པ་ནི།
en: He was beautiful with his splendor and majesty,

source: །སེམས་ཅན་རྣམས་ལ་བརྩེ་ཕྱིར་གྲོང་དུ་འོངས།
en: And through his love for beings he had come to town. {82}

source: །ང་ནི་གཟུགས་ཀྱང་དེ་ཙམ་མི་ཕོད་པས།
en: “I could not be his equal in appearance,

source: །དེ་ལ་ང་ཡང་འཇུངས་པ་མ་རུངས་སྐྱེས།
en: And a malevolent envy arose within me.

source: །འདོད་ལ་ཆགས་ཤིང་སྲིད་ལ་བཅིངས་པས་ན།
en: I was attached to desires and clung to my kingdom,

source: །འདི་ནི་བདག་གི་སྲིད་ལས་སྐྱོད་སྙམ་སྟེ།
en: And thought he would deprive me of my kingdom. {83}

source: །ང་ཡི་བུ་རྣམས་སྟོང་དུ་ཚང་བ་ཡང་།
en: “I had sons that numbered a full thousand,

source: །ཤིང་རྟར་ཞུགས་ཤིང་ཞབས་འབྲིང་མཐོན་དམན་འགྲོ།
en: Who were following behind me riding in chariots,

source: །ཅོད་པན་དང་ནི་སྣ་ཚོགས་རྒྱན་གྱིས་བརྒྱན།
en: And who wore various kinds of diadems and jewelry,

source: །སུམ་ཅུ་དབང་ཕྱིར་ལྷ་ཡི་བུ་འབྲང་བཞིན།
en: As if the devas who were lords of Trāyastriṃśa had come. {84}

source: །དེ་ན་ང་ཡི་བུ་མོ་ལྔ་བརྒྱ་དག །ནོར་བུ་ཐོགས་ཤིང་ལྷམ་གྱོན་བལྟ་ན་སྡུག །མགོ་རྒྱན་དང་ནི་ལྷབ་ལྷུབ་རྒྱན་གྱིས་སྤུད།
en: “I also had there five hundred daughters, Who were very beautiful and wore bejeweled shoes, Beautified by ribbons, diadems, and jewelry,

source: །དེ་དག་གསེར་གྱི་དྲ་བས་ཤིང་རྟ་འདྲེན།
en: Who pulled my chariot with cords of gold. {85}
